[
  {
    "occupation": "Backend Engineer II",
    "industry": "Technology",
    "company": "The U Group & Co",
    "period": "2025.03 - Present",
    "technologies": ["Typescript", "Python", "SQL", "Bash", "AWS Cloud", "Git", "snowflake"],
    "description": [
      "Designed, developed, and maintained backend services using Python and TypeScript, ensuring scalable, reliable, and maintainable systems.",
      "Built and optimized cross-service APIs to improve interoperability across microservices and enhance developer experience.",
      "Managed and optimized AWS infrastructure for migration, performance, reliability, and cost-efficiency.",
      "Implemented CI/CD pipelines and automated deployments to streamline release processes and reduce operational overhead.",
      "Contributed to frontend features using React for internal tools and dashboards, supporting better visibility into system and data processes.",
      "Collaborated with data and ML teams to integrate backend services with data pipelines and analytics systems."
    ]
  },
  {
    "occupation": "Data Engineer II",
    "industry": "Technology",
    "company": "The U Group & Co",
    "period": "2025.01 - 2025.03",
    "technologies": ["Python", "SQL", "Bash", "AWS Cloud", "Git", "snowflake"],
    "description": [
      "Managed and optimized data pipelines, utilizing Snowflake, dbt, and SQL to streamline data transformation and storage processes.",
      "Developed and maintained Python-based machine learning pipelines for predictive analytics and data processing tasks.",
      "Used ETLeap to automate data integration and migration tasks, improving efficiency in data workflows.",
      "Designed and orchestrated data pipelines with Dagster, ensuring reliability, monitoring, and efficient task execution.",
      "Leveraged AWS cloud technologies to build scalable, secure data infrastructure."
    ]
  },
  {
    "occupation": "Data Engineer I",
    "industry": "Technology",
    "company": "The U Group & Co",
    "period": "2024.03 - 2025.01",
    "technologies": ["Python", "SQL", "Bash", "AWS Cloud", "Git", "snowflake"],
    "description": [
      "Delivered high-quality data sets to clients, ensuring timely and accurate reporting",
      "Troubleshot and resolved complex data flow, storage, and accessibility challenges, improving system performance.",
      "Managed and optimized data pipelines, utilizing Snowflake, dbt, and SQL to streamline data transformation and storage processes.",
      "Collaborated with cross-functional teams to ensure data integrity, efficiency, and alignment with client needs."
    ]
  },
  {
    "occupation": "Casual Teaching Assistant",
    "industry": "Education",
    "company": "University of Western Australia",
    "period": "2024.02 - 2024.03",
    "technologies": ["Python", "HTML", "SQL", "CSS", "Linux", "Git"],
    "description": ["CITS5505 - Agile Web Development", "CITS1003 - Introduction to Cybersecurity"]
  },
  {
    "occupation": "Full Stack Developer",
    "industry": "Technology",
    "company": "Coder For Causes",
    "period": "2022.07 - 2024.02",
    "technologies": [
      "Figma",
      "Typescript",
      "Javascript",
      "React",
      "Next.js",
      "PostgreSQL",
      "Prisma",
      "Firebase",
      "AWS",
      "Docker",
      "Tailwind CSS",
      "Vercel",
      "Git"
    ],
    "description": ["Developed a web application for a client to manage their business operations."]
  },
  {
    "occupation": "Assistant Manager",
    "industry": "Financial Services",
    "company": "Deloitte",
    "period": "2019.03 - 2020.08",
    "technologies": ["US GAAP", "IFRS", "SOX", "COSO framework", "Excel", "Power BI"],
    "description": [
      "Possessed sound knowledge of US GAAP, IFRS, and SOX internal control audits.",
      "Performed financial modelling to support and challenge key assumptions, such as DCF models.",
      "Performed risk assessment of material financial statement items under the COSO framework.",
      "Performed valuation analysis of assets, debt, and equity, such as intangible assets impairment and convertible bonds.",
      "Utilized IT skills for data cleaning, manipulation, and mapping.",
      "Led 4 members and managed audit plan for listed companies.",
      "Supervised, coached, and developed junior members of staff within teams, on client premises, and in the office."
    ]
  },
  {
    "occupation": "Staff - Senior Associate",
    "industry": "Financial Services",
    "company": "PwC",
    "period": "2016.09 - 2019.02",
    "technologies": ["IFRS9", "Financial Analysis", "Net Asset Value", "Return on Investment", "Cash Flow Forecasting"],
    "description": [
      "Conducted in the Biotechnology Industry’s initial public offering project.",
      "Evaluated investment profiles including local/international, public/private stocks, and bonds under IFRS9.",
      "Evaluated derivative financial instruments.",
      "Recalculated net asset value and return on investment.",
      "Reviewed cash flow forecasts for the prospectus to assess the feasibility of the assumptions.",
      "Assessed financial risk information, including market risk, credit risk, liquidity risk, interest rate risk, and sensitive analysis of each."
    ]
  },
  {
    "occupation": "Intermediate Accounting Instructor",
    "industry": "Education",
    "company": "Tekom Technologies, Inc",
    "period": "2016.03 - 2016.06",
    "technologies": ["Intermedia Accounting", "Educational Facilitation"],
    "description": [
      "Provided guidance and delivered effective instruction in Intermediate Accounting, facilitating student understanding and proficiency."
    ]
  },
  {
    "occupation": "Facilitator",
    "industry": "Education",
    "company": "National Chung Cheng University",
    "period": "2015.02 - 2016.06",
    "technologies": ["Business Analysis", "Accounting", "Advanced Accounting", "Audit", "Statistics"],
    "description": [
      "Assisted in teaching courses including Business Analysis, Accounting, Advanced Accounting, Audit, and Statistics.",
      "Provided guidance and handouts."
    ]
  }
]
